Revit 2020 API
GBXMLExportOptions Properties
The GBXMLExportOptions type exposes the following members.
Properties
Name | Description
Encoding
 The encoding options to go into the processing instruction for the exported gbXML file.
ExportEnergyModelType
 The energy model type from which gbXML will be exported.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
GBXMLExportOptions Class
Autodesk.Revit.DB Namespace